АПК/Enums/СостояниеЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостояниеЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗапланированоВБудущем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПроверке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готово</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внедрено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

АПК/Catalogs/УчетныеЗаписиTelegram.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиTelegram</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

АПК/CommonModules/МодульСотрудников/Ext/Module.bsl
Функция ПодсчетСотрудников(КоличествоСотрудников) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка			 = РезультатЗапроса.Выбрать();
	
	КоличествоСотрудников = Выборка.Количество();
	
	Возврат КоличествоСотрудников;
	
КонецФункции

Функция ПосчитатьЗадачиСотрудника() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Задача.Наименование КАК НаименованиеЗадачи,
	|	Задача.Исполнитель КАК Исполнитель,
	|	Задача.Назначающий КАК Назначающий
	|ИЗ
	|	Задача.Задача КАК Задача
	|ГДЕ
	|	Задача.Исполнитель = &Исполнитель
	|	И Задача.ПометкаУдаления = ЛОЖЬ
	|	И Задача.Выполнена = ЛОЖЬ
	|	И НЕ Задача.СостояниеЗадачи = &СостояниеЗадачи";
	Запрос.УстановитьПараметр("Исполнитель", ПараметрыСеанса.ТекущийСотрудник);
	Запрос.УстановитьПараметр("СостояниеЗадачи", Перечисления.СостояниеЗадач.Готово);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка			 = РезультатЗапроса.Выбрать();
	
	Возврат Выборка.Количество();
	
КонецФункции

Функция ПолучитьTelegramIDТекущегоПользователя() Экспорт 
	
	ТекПользователь = ПараметрыСеанса.ТекущийСотрудник;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчетныеЗаписиTelegram.Ссылка КАК Ссылка,
	|	УчетныеЗаписиTelegram.ВерсияДанных КАК ВерсияДанных,
	|	УчетныеЗаписиTelegram.ПометкаУдаления КАК ПометкаУдаления,
	|	УчетныеЗаписиTelegram.Наименование КАК Наименование,
	|	УчетныеЗаписиTelegram.ID КАК ID,
	|	УчетныеЗаписиTelegram.Сотрудник КАК Сотрудник,
	|	УчетныеЗаписиTelegram.Предопределенный КАК Предопределенный,
	|	УчетныеЗаписиTelegram.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ИЗ
	|	Справочник.УчетныеЗаписиTelegram КАК УчетныеЗаписиTelegram
	|ГДЕ
	|	НЕ УчетныеЗаписиTelegram.ПометкаУдаления
	|	И ВЫРАЗИТЬ(УчетныеЗаписиTelegram.Сотрудник КАК Справочник.Сотрудники) В (&ТекПользователь)";
	Запрос.УстановитьПараметр("ТекПользователь", ТекПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	
	Возврат Выгрузка;
	
КонецФункции
